Tekla.Structures.DialogInternal.ProfileAttributes
Profile attributes

Tekla.Structures.DialogInternal.ProfileAttributes.Profile
Gets or sets the profile name

Tekla.Structures.DialogInternal.ProfileAttributes.SelectedCallback
Gets or sets the profile selected callback action.

Tekla.Structures.DialogInternal.ProfileAttributes.ClosedCallback
Gets or sets the window closed callback action.